app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-01-18 15:48:04.946153"], ["updated_at", "2019-01-18 15:48:04.946153"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-01-18 15:48:04.947527"], ["updated_at", "2019-01-18 15:48:04.947527"], ["artist_id", 138]]
---
  def upload
    CSV.foreach(params[:file].path, headers:true) do |lead|
      Song.create(title: lead[0], artist_name: lead[1])